In [2]:
# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [3]:
# Ans- 

import pandas as pd

In [4]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [5]:
series = pd.Series([4,8,15,16,23,42], index=[1,2,3,4,5,6])

In [6]:
series

1     4
2     8
3    15
4    16
5    23
6    42
dtype: int64

In [7]:
# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
#     variable print it.

In [8]:
# Ans- 

var = ['a','b','c','d','e','f','g','h','i','j']
pd.Series(var)

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
8    i
9    j
dtype: object

In [9]:
# Q3. Create a Pandas DataFrame that contains the following data:
    
    # Name      Age       Gender
    # Alice     25        Female
    # Bob       30        Male
    # Claire    27        Female
    
# Then, print the DataFrame.

In [10]:
# Ans-
df = pd.DataFrame({"Name" : ['Alice', 'Bob', 'Claire'],
                   "Age" : [25, 30, 27],
                   "Gender" : ['Female', 'Male', 'Female']
                  })

In [136]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [11]:
# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [14]:
# Ans- DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it 
#      like a spreadsheet or SQL table, or a dict of Series objects. It is generally the most commonly used pandas object.
#      A pandas series is a one-dimensional data structure that comprises of key-value pair, where keys/labels are the indices
#      and values are the values stored on that index. It is similar to a python dictionary, except it provides more freedom to
#      manipulate and edit the data.

In [15]:
# Example :-
df1 = pd.DataFrame({"Name" : ['Alice', 'Bob', 'Claire'],
                   "Age" : [25, 30, 27],
                   "Gender" : ['Female', 'Male', 'Female']
                  })

In [16]:
df1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [17]:
type(df1)

pandas.core.frame.DataFrame

In [18]:
df1['Name']

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [19]:
type(df1['Name'])

pandas.core.series.Series

In [20]:
# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you 
#     might use one of these functions?

In [21]:
# Ans- 
df2 = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [22]:
df2

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [24]:
# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [25]:
# Ans- There are 3 data structures provided by the Pandas module, which are as follows: 

#      Series:- It is a 1-D size-immutable array like structure having homogeneous data. 
#      DataFrames: It is a 2-D size-mutable tabular structure with heterogeneously typed columns. 
#      Panel: It is a 3-D, size-mutable array.

#      All Pandas data structures are value mutable (can be changed) and except Series all are size mutable. Series is size 
#      immutable. DataFrame is widely used and one of the most important data structures. Panel is used much less.

In [26]:
# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [150]:
fruits_name =  ['mango', 'grapes', 'banana', 'apple', 'kiwi']

In [151]:
series_1 = pd.Series(fruits_name)

In [152]:
series_1

0     mango
1    grapes
2    banana
3     apple
4      kiwi
dtype: object

In [153]:
df3 = pd.DataFrame({'fruits_name': series_1})

In [154]:
df3

  fruits_name
0       mango
1      grapes
2      banana
3       apple
4        kiwi

In [155]:
df3['summer_price'] = pd.Series([23,32,73,20,89])

In [156]:
df3

  fruits_name  summer_price
0       mango            23
1      grapes            32
2      banana            73
3       apple            20
4        kiwi            89

In [157]:
df3['winter_price'] = pd.Series([63,54,32,43,78])

In [158]:
df3

  fruits_name  summer_price  winter_price
0       mango            23            63
1      grapes            32            54
2      banana            73            32
3       apple            20            43
4        kiwi            89            78

In [159]:
df3['monsoon_price'] = pd.Series([83,92,73,73,90])

In [160]:
df3

  fruits_name  summer_price  winter_price  monsoon_price
0       mango            23            63             83
1      grapes            32            54             92
2      banana            73            32             73
3       apple            20            43             73
4        kiwi            89            78             90